# Розрахунок місячного депозиту.
# Приклад: маємо рахунок X (початковий вклад) + вводимо ставку депозиту на місяць. + Неоьхідно розрахувати який буде дохід за 1 місяць.


def bankdepos():
    print("-- Програма для розрахунко доходів від місячного депозиту --")
    print("Введіть початкову ставку депозиту")
    x = float(input())
    print("Введіть місячну ставку депозиту: ")
    mounthrate = float(input())
    print("введіть кількість місяців: ")
    allmonth = int(input())

    month_revenue = round(((x / 100)) * float(mounthrate) + float(x), 2) #Стан депозитного рахунку після виплати доходу за місяць.
    i = 1
#розрахунок доходу за кількіка місяців
    while i <= allmonth:
        month_revenue = round(((x / 100)) * float(mounthrate), 2)
        x += month_revenue

        print("На ", i ,"місяць, на рахунку буде: ", round(x, 2))
        i +=1


